In [1]:
import os
import glob
import re
import numpy as np
import pandas as pd

In [ ]:
non_indicators = [
    'global-population.csv', 'health-population-country-summary.csv',
    'world-development-indicators-country-summary.csv'
]

In [ ]:
kFILE_PATH = '/Users/milko/Local/Data/Disease/Kaggle-COVID-19/world_bank/'
files = [
    'climate-change.csv', 'community-health-workers-per-1-000-people.csv',
    'environment-social-and-governance-data.csv',
    'hospital-beds-per-1-000-people.csv', 'international-debt.csv',
    'nurses-and-midwives-per-1-000-people.csv',
    'people-with-basic-handwashing-facilities-including-soap-and-water-of-population.csv',
    'physicians-per-1-000-people.csv', 'smoking-prevalence-total-ages-15.csv',
    'specialist-surgical-workforce-per-100-000-population.csv'  
]

In [ ]:
dictionary = dict()
for file in files:
    print(file)
    
    df = pd.read_csv(
        kFILE_PATH+file,
        usecols=['indicator_code', 'indicator_name']
    ).drop_duplicates(ignore_index=True)
    
    for idx in range(0, len(df) - 1):
        dictionary[df.loc[idx]['indicator_code']] =\
            df.loc[idx]['indicator_name']
dictionary

In [ ]:
test = pd.read_csv(
    '/Users/milko/Downloads/test.csv'
)
test.drop(columns=['indicator_name', 'untitled_1'], inplace=True)
test.head()

In [2]:
file = '/Users/milko/Local/Data/Disease/Kaggle-COVID-19/world_bank/global-population.csv'

In [4]:
result = pd.read_csv(file)\
    .melt(id_vars=['country', 'country_code'], var_name='year')\
    .dropna(axis=0, how='any')
result['year'] = result['year'].apply(lambda x: x[5:])
result.head()

                country country_code  year        value
4              Cambodia          KHM  1960    5722370.0
5  United Arab Emirates          ARE  1960      92418.0
6                Cyprus          CYP  1960     572930.0
7   Lower middle income          LMC  1960  928490499.0
8              Maldives          MDV  1960      89863.0

In [17]:
df = pd.read_csv(
    '/Users/milko/Local/Data/Disease/Kaggle-COVID-19/world_bank/global-population.csv'
).melt(id_vars=['country', 'country_code'])
df.head()

                     country country_code   variable      value
0  Sint Maarten (Dutch part)          SXM  year_1960        NaN
1             Not classified          INX  year_1960        NaN
2         West Bank and Gaza          PSE  year_1960        NaN
3                     Serbia          SRB  year_1960        NaN
4                   Cambodia          KHM  year_1960  5722370.0

In [18]:
df['year'] = df['variable'].apply(lambda x: x[5:])
df.head()

                     country country_code   variable      value  year
0  Sint Maarten (Dutch part)          SXM  year_1960        NaN  1960
1             Not classified          INX  year_1960        NaN  1960
2         West Bank and Gaza          PSE  year_1960        NaN  1960
3                     Serbia          SRB  year_1960        NaN  1960
4                   Cambodia          KHM  year_1960  5722370.0  1960

In [13]:
df.head()

  country_code  indicator_code       value  year
0          TCD  DT.INT.DLXF.CD  11342411.0   NaN
1          TCD  DT.AMT.BLAT.CD  51630506.9   NaN
2          TCD  DT.INT.BLAT.CD   2880958.8   NaN
3          TCD  DT.DIS.MLAT.CD   3863826.8   NaN
4          TCD  DT.AMT.OFFT.CD  97818360.6   NaN